app/views/user_registers/_form.html.erb

    <%= f.label :eventID %>
    <%= f.select :eventID, Event.all.collect {|c| [c.name, c.id]},{prompt: "Select an Event"} %>
---
SELECT "events".* FROM "events"