app/views/events/_form.html.erb


    <%= f.select :categoryID, Category.all.collect {|c| [c.name, c.id] }, {prompt: "Select Category"} %>
---
SELECT "categories".* FROM "categories"