app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("active", "created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["active", false], ["created_at", Sun, 09 Mar 2014 21:37:16 UTC +00:00], ["description", "park and other stuff"], ["name", "Gardening"], ["updated_at", Sun, 09 Mar 2014 21:37:16 UTC +00:00]]