app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("active", "categoryID", "created_at", "description", "duration", "name", "number_volunteer", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)